app/controllers/books_controller.rb

INSERT INTO "books" ("created_at", "updated_at", "body", "title", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2020-06-22 09:44:38.600890"], ["updated_at", "2020-06-22 09:44:38.600890"], ["body", "x"], ["title", "x"], ["user_id", 2]]
SELECT "books".* FROM "books"
---
    def create
        @book = Book.new(book_params)
    	@book.user_id = current_user.id
    	 if @book.save

            redirect_to @book, notice: "successfully create book!"
         else
        @books = Book.all

SELECT "books".* FROM "books"
---
    def index
        @oioi = "1"

    	@book = Book.new

        @books = Book.all