app/models/user.rb

  def follow!(other_user)
    following_relationships.create!(following_id: other_user.id)
---
INSERT INTO "relationships" ("follower_id", "following_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["following_id", 1], ["created_at", "2020-06-23 07:33:49.314291"], ["updated_at", "2020-06-23 07:33:49.314291"]]

  def unfollow!(other_user)
    following_relationships.find_by(following_id: other_user.id).destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]